#ifndef C_WND_GRAPHICS_H
#define C_WND_GRAPHICS_H

//****************************************************************************************************
//Класс окна графиков в Windows
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "../stdafx.h"
#include "igraphics.h"
#include "ivideo.h"
#include <memory>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Класс окна графиков в Windows
//****************************************************************************************************
class CWnd_Graphics:public CWnd
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
  static const DWORD IDC_GRAPHICS_TIMER_MAIN=1001;//идентификатор таймера
 private:
  //-переменные-----------------------------------------------------------------------------------------
  LPCTSTR ClassName;//имя класса окна

  std::unique_ptr<IVideo> iVideo_Ptr;//указатель на класс отображения графика
  std::unique_ptr<IGraphics> iGraphics_Ptr;//указатель на класс графика

  bool LButtonState;//состояние кнопок мышки
  bool RButtonState;
  bool CButtonState;
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CWnd_Graphics(void);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CWnd_Graphics();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  BOOL Create(DWORD dwStyle,RECT rect,CWnd *pParentWnd);//создать окно
  IGraphics* GetIGraphicsPtr(void);//получить класс работы с графиками
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
  void SetMouseButtonState(UINT nFlags);//задать состояние кнопок мышки
 protected:
  //-функции обработки сообщений------------------------------------------------------------------------   
  DECLARE_MESSAGE_MAP()
  afx_msg void OnDestroy(void);//событие уничтожения окна
  afx_msg void OnTimer(UINT nIDEvent);//событие таймера
  afx_msg void OnPaint(void);//событие отрисовки окна
  afx_msg BOOL OnEraseBkgnd(CDC *pDC);//событие очистки фона окна
  afx_msg void OnLButtonDown(UINT nFlags,CPoint point);//событие нажатия левой кнопки мышки
  afx_msg void OnRButtonDown(UINT nFlags,CPoint point);//событие нажатия правой кнопки мышки
  afx_msg void OnRButtonUp(UINT nFlags,CPoint point);//событие отпускания правой кнопки мышки
  afx_msg void OnLButtonUp(UINT nFlags,CPoint point);//событие отпускания левой кнопки мышки
  afx_msg void OnMouseMove(UINT nFlags,CPoint point);//событие перемещения мышки
  afx_msg BOOL OnSetCursor(CWnd *pWnd,UINT nHitTest,UINT message);//событие смены курсора
};

#endif