//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "ivideo.h"
#include "cvideo_software.h"
//#include "cvideo_qt.h"
#include "cvideo_windows.h"

//****************************************************************************************************
//статические функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//создать класс программной растеризации
//----------------------------------------------------------------------------------------------------
IVideo* IVideo::CreateNewCVideoSoftware(uint32_t width,uint32_t height)
{
 return(new CVideo_Software(width,height));
}
//----------------------------------------------------------------------------------------------------
//создать класс растеризации с помощью Qt
//----------------------------------------------------------------------------------------------------
IVideo* IVideo::CreateNewCVideoQt(uint32_t width,uint32_t height)
{
 return(NULL);
 //return(new CVideo_Qt(width,height));
}
//----------------------------------------------------------------------------------------------------
//создать класс растеризации с помощью Windows
//----------------------------------------------------------------------------------------------------
IVideo* IVideo::CreateNewCVideoWindows(uint32_t width,uint32_t height,CWnd *cWnd_Ptr)
{ 
 return(new CVideo_Windows(width,height,cWnd_Ptr));
}
